# Направете програма, в която студентът трябва да въведе успеха си и максимална стипендия.
# 1) Ако има успех по-голям или равен на 5.50, получава максимална стипендия.
# 2) Ако успехът му е по-малък от 5.50 и по-голям или равен на 5, получава 70% от максималната стипедия.
# 3) Ако успехът му е по-малък от 5 и по-голям или равен на 4.50, получава 50% от максималната стипедия.
# 4) Ако успехът му е по-малък от 4.50, не получава нищо.

success = float(input("Enter success: "))
max_scholarship = float(input("Enter maximum scholarship: "))
if success >= 5.50:
    print(max_scholarship)
elif 5 <= success < 5.50:
    print(max_scholarship*0.7)
elif 4.50 <= success < 5:
    print(max_scholarship*0.5)
else:
    print("Sorry")
 
  
